driver-tests/bpelse/dynamicpartnerlink/correlation/CorrelationTwoPropJBI/test/Receive_Receive_InitEmpty/Output1.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd">
      <ns0:string xmlns:ns0="http://xml.netbeans.org/schema/dataTypes.xsd">Test StringTest String</ns0:string>
      <ns0:int xmlns:ns0="http://xml.netbeans.org/schema/dataTypes.xsd">24690</ns0:int>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>