driver-tests/bpelse/assign/Assign2JBI/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:helloObj xmlns:msgns="http://j2ee.netbeans.org/wsdl/newWSDL" xmlns:ns1="http://xml.netbeans.org/schema/dataTypes.xsd">
      <ns1:string newAttribute="firstNode"/>
      <ns1:string xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" newAttribute="SecondInputAttribute">SecondValue</ns1:string>
      <ns1:string/>
      <ns1:string xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" newAttribute="FirstInputAttribute">FirstValue</ns1:string>
    </ns1:helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
